{
    "jobs": [
        {
            "id": 1,
            "title": "CoStar Group",
            "subtitle": "Software Engineer",
            "startDate": "Apr 2022",
            "endDate": "Present",
            "image": "https://images.ctfassets.net/bxvspbo2e7cv/5vo4dt2RN1hyYvLbcsnwR0/d65b08277f539d86cc46126d2786b5ec/png",
            "details": [
                "Supported integration team moving financial system from Microsoft Navision to Oracle Fusion Cloud Financials.",
                "Developed proxy ASP.NET endpoints to interact with Oracle Fusion Cloud Financials API and Microsoft Navision web services.",
                "Assisted internal database schema development for handling client payment history."
            ]
        },
        {
            "id": 2,
            "title": "CGI",
            "subtitle": "Software Developer",
            "startDate": "Jun 2021",
            "endDate": "Apr 2022",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/CGI_logo.svg/800px-CGI_logo.svg.png",
            "details": [
                "Developed Microsoft Power Apps solution for government client including a C# codebase for plug-ins.",
                "Provided technical support of enterprise-level application for government client focusing on defects, enhancements, and patches.",
                "Researched technologies to better enhance product capability and improve the efficiency of completing support work.",
                "Personally maintained AWS EC2 work environment for development and testing."
            ]
        },
        {
            "id": 3,
            "title": "General Dynamics Information Technology",
            "subtitle": "Technical Intern",
            "startDate": "Jun 2020",
            "endDate": "May 2021",
            "image": "https://trajectorymagazine.com/wp-content/uploads/2022/03/gdit_sht_lgtagline_pms_white-glc-cropped.png",
            "details": [
                "Participated in all phases of the development lifecycle creating critical software solutions to support ongoing projects within GDIT.",
                "Assessed feasibility and proposed development plans for potential projects.",
                "Completed successful mobile (Android) and desktop projects unsupervised, while utilizing the agile software development process.",
                "Demonstrated adaptability, technological interest, and self-drive by taking on projects that involved learning new pieces of technology.",
                "Consulted customers on requirements, progress, roadblocks, and compromises using soft skills."
            ]
        }        
    ]
}